Revit 2021.1 API
Document.Link Method
Overload List
Name | Description
Link(String, DWFImportOptions)
 Links Markups in a DWF file into the project document.
Link(String, SATImportOptions, View)
 Links an SAT file into the project document.
Link(String, SKPImportOptions, View)
 Links an SKP file into the project document.
Link(String, DGNImportOptions, View, ElementId)
 Links a DGN file into the project document.
Link(String, DWGImportOptions, View, ElementId)
 Links a DWG or DXF file into the project document.
See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace